let oldDates = [{
    "date": "2021.8.20",
    "time": [],
    "status": []
  },{
   "date": "2021.8.21",
    "time": ["15:00"],
    "status": ["Занята"]
  },{
   "date": "2021.8.24",
    "time": ["12:00"],
    "status": ["Занята"]
  },{
   "date": "2021.9.9",
    "time": [],
    "status": []
  },{
   "date": "2021.9.3",
    "time": [
      "08:00"
    ],
    "status": ["Занята"]
  },{
   "date": "2021.9.7",
    "time": ["15:00"],
    "status": ["Занята"]
  },{
   "date": "2021.9.12",
    "time": ["15:00"],
    "status": ["Занята"]
  },{
   "date": "2021.10.9",
    "time": ["14:00"],
    "status": ["Занята"]
  },{
   "date": "2021.11.7",
    "time": ["12:15"],
    "status": ["Занята"]
  },{
   "date": "2021.11.25",
    "time": ["11:00"],
    "status": ["Занята"]
  },{
   "date": "2021.11.28",
    "time": ["10:00"],
    "status": ["Занята"]
  },{
   "date": "2022.0.21",
    "time": ["17:00"],
    "status": ["Занята"]
  },{
   "date": "2022.1.9",
    "time": ["12:00"],
    "status": ["Занята"]
  },{
   "date": "2022.1.10",
    "time": ["11:00"],
    "status": ["Занята"]
  },{
   "date": "2022.1.11",
    "time": ["12:00"],
    "status": ["Занята"]
  },{
   "date": "2021.8.15",
    "time": ["12:00","15:20"],
    "status": ["Занята","Свободна"]
  },{
   "date": "2022.2.30",
    "time": ["14:00"],
    "status": ["Занята"]
  },{
   "date": "2022.2.31",
    "time": ["10:00"],
    "status": ["Занята"]
  },{
   "date": "2022.3.14",
    "time": ["14:00"],
    "status": ["Занята"]
  },{
   "date": "2022.3.10",
    "time": ["10:00"],
    "status": ["Занята"]
  },{
   "date": "2022.3.8",
    "time": ["11:00"],
    "status": ["Занята"]
  },{
   "date": "2022.3.9",
    "time": ["11:00"],
    "status": ["Занята"]
  },{
   "date": "2022.3.12",
    "time": ["09:00"],
    "status": ["Занята"]
  },{
   "date": "2022.3.23",
    "time": ["10:00"],
    "status": ["Занята"]
  },{
   "date": "2022.3.19",
    "time": ["11:00"],
    "status": ["Занята"]
  },{
   "date": "2022.3.25",
    "time": ["12:00"],
    "status": ["Занята"]
  },{
   "date": "2022.3.28",
    "time": ["13:00"],
    "status": ["Занята"]
  },{
   "date": "2022.3.29",
    "time": ["11:00"],
    "status": ["Занята"]
  },{
   "date": "2022.4.5",
    "time": ["13:00"],
    "status": ["Занята"]
  },{
   "date": "2022.4.7",
    "time": ["10:00"],
    "status": ["Занята"]
  },{
   "date": "2022.4.6",
    "time": ["15:00"],
    "status": ["Занята"]
  },{
   "date": "2022.4.12",
    "time": [
      "10:00",
      "05:00"
    ],
    "status": [
      "Занята",
      "Занята"
    ]
  },{
   "date": "2022.4.13",
    "time": [
      "02:00"
    ],
    "status": ["Занята"]
  },{
   "date": "2022.4.10",
    "time": [
      "02:00",
      "12:00"
    ],
    "status": [
      "Занята",
      "Занята"
    ]
  },{
   "date": "2022.4.9",
    "time": [
      "01:00"
    ],
    "status": ["Занята"]
  },{
   "date": "2022.4.11",
    "time": [
      "11:00",
      "10:00"
    ],
    "status": [
      "Занята",
      "Занята"
    ]
  },{
   "date": "2022.4.14",
    "time": ["11:00"],
    "status": ["Занята"]
  },{
   "date": "2022.4.15",
    "time": ["09:00"],
    "status": ["Занята"]
  },{
   "date": "2022.4.16",
    "time": ["12:00"],
    "status": ["Занята"]
  },{
   "date": "2022.4.17",
    "time": ["10:00"],
    "status": ["Занята"]
  },{
   "date": "2022.4.20",
    "time": ["12:00"],
    "status": ["Занята"]
  },{
   "date": "2022.4.24",
    "time": ["11:00"],
    "status": ["Занята"]
  },{
   "date": "2022.4.30",
    "time": ["11:00"],
    "status": ["Занята"]
  },{
   "date": "2022.4.25",
    "time": [
      "13:05"
    ],
    "status": ["Занята"]
  },{
   "date": "2022.4.31",
    "time": ["10:00"],
    "status": ["Занята"]
  },{
   "date": "2022.5.2",
    "time": ["09:00"],
    "status": ["Занята"]
  },{
   "date": "2022.5.1",
    "time": ["12:00"],
    "status": ["Занята"]
  },{
   "date": "2022.4.29",
    "time": [
      "18:00"
    ],
    "status": ["Занята"]
  },{
   "date": "2022.5.3",
    "time": ["16:00"],
    "status": ["Занята"]
  },{
   "date": "2022.5.11",
    "time": ["15:00"],
    "status": ["Занята"]
  },{
   "date": "2022.5.7",
    "time": ["13:00"],
    "status": ["Занята"]
  },{
   "date": "2022.5.4",
    "time": ["12:00"],
    "status": ["Занята"]
  },{
   "date": "2022.5.8",
    "time": ["17:00"],
    "status": ["Занята"]
  },{
   "date": "2022.5.6",
    "time": ["17:00"],
    "status": ["Занята"]
  },{
   "date": "2022.5.9",
    "time": [
      "19:00",
      "10:00"
    ],
    "status": [
      "Занята",
      "Занята"
    ]
  },{
   "date": "2022.5.10",
    "time": ["12:00"],
    "status": ["Занята"]
  },{
   "date": "2022.5.14",
    "time": ["11:00"],
    "status": ["Занята"]
  },{
   "date": "2022.5.13",
    "time": [
      "11:00",
      "17:00"
    ],
    "status": [
      "Занята",
      "Занята"
    ]
  },{
   "date": "2022.5.17",
    "time": ["11:00"],
    "status": ["Занята"]
  },{
   "date": "2022.5.18",
    "time": ["12:00"],
    "status": ["Занята"]
  },{
   "date": "2022.5.25",
    "time": ["12:00"],
    "status": ["Занята"]
  },{
   "date": "2022.5.21",
    "time": ["17:00"],
    "status": ["Занята"]
  },{
   "date": "2022.5.23",
    "time": ["12:00"],
    "status": ["Занята"]
  },{
   "date": "2022.5.24",
    "time": [
      "11:00",
      "17:00"
    ],
    "status": [
      "Занята",
      "Занята"
    ]
  },{
   "date": "2022.6.3",
    "time": ["12:00"],
    "status": ["Занята"]
  },{
   "date": "2022.5.28",
    "time": ["11:00"],
    "status": ["Занята"]
  },{
   "date": "2022.6.7",
    "time": ["17:00"],
    "status": ["Занята"]
  },{
   "date": "2022.5.30",
    "time": ["10:00"],
    "status": ["Занята"]
  },{
   "date": "2022.5.29",
    "time": ["11:00"],
    "status": ["Занята"]
  },{
   "date": "2022.6.1",
    "time": ["13:00"],
    "status": ["Занята"]
  },{
   "date": "2022.6.11",
    "time": [],
    "status": []
  },{
   "date": "2022.6.12",
    "time": [],
    "status": []
  },{
   "date": "2022.6.5",
    "time": ["13:00"],
    "status": ["Занята"]
  },{
   "date": "2022.6.10",
    "time": ["11:00"],
    "status": ["Занята"]
  },{
   "date": "2022.6.8",
    "time": ["11:00"],
    "status": ["Занята"]
  },{
   "date": "2022.6.14",
    "time": ["12:00"],
    "status": ["Занята"]
  },{
   "date": "2022.6.15",
    "time": ["11:00"],
    "status": ["Занята"]
  },{
   "date": "2022.6.13",
    "time": ["12:00"],
    "status": ["Занята"]
  },{
   "date": "2022.6.16",
    "time": ["12:00"],
    "status": ["Занята"]
  },{
   "date": "2022.6.18",
    "time": ["11:00"],
    "status": ["Занята"]
  },{
   "date": "2022.6.19",
    "time": [
      "17:30"
    ],
    "status": ["Занята"]
  },{
   "date": "2022.6.21",
    "time": ["12:00"],
    "status": ["Занята"]
  },{
   "date": "2022.6.20",
    "time": [],
    "status": []
  },{
   "date": "2022.6.25",
    "time": ["10:00"],
    "status": ["Занята"]
  },{
   "date": "2022.6.22",
    "time": ["11:00"],
    "status": ["Занята"]
  },{
   "date": "2022.6.26",
    "time": ["13:00"],
    "status": ["Занята"]
  },{
   "date": "2022.6.27",
    "time": ["11:00"],
    "status": ["Занята"]
  },{
   "date": "2022.6.28",
    "time": ["11:00"],
    "status": ["Занята"]
  },{
   "date": "2022.6.30",
    "time": ["12:00"],
    "status": ["Занята"]
  },{
   "date": "2022.7.2",
    "time": [
      "02:00"
    ],
    "status": ["Занята"]
  },{
   "date": "2022.7.1",
    "time": ["11:00"],
    "status": ["Занята"]
  },{
   "date": "2022.6.6",
    "time": ["10:00"],
    "status": ["Занята"]
  },{
   "date": "2022.7.3",
    "time": ["10:00"],
    "status": ["Занята"]
  },{
   "date": "2022.6.31",
    "time": ["11:00"],
    "status": ["Занята"]
  },{
   "date": "2022.7.5",
    "time": ["13:00"],
    "status": ["Занята"]
  },{
   "date": "2022.7.4",
    "time": ["10:00"],
    "status": ["Занята"]
  },{
   "date": "2022.7.9",
    "time": ["12:00"],
    "status": ["Занята"]
  },{
   "date": "2022.7.8",
    "time": ["09:00"],
    "status": ["Занята"]
  },{
   "date": "2022.7.6",
    "time": ["17:00"],
    "status": ["Занята"]
  },{
   "date": "2022.7.10",
    "time": ["17:00"],
    "status": ["Занята"]
  },{
   "date": "2022.7.11",
    "time": ["12:00"],
    "status": ["Занята"]
  },{
   "date": "2022.7.12",
    "time": ["13:00"],
    "status": ["Занята"]
  },{
   "date": "2022.7.15",
    "time": [
      "13:00",
      "14:00",
      "16:00"
    ],
    "status": [
      "Занята",
      "Занята",
      "Занята"
    ]
  },{
   "date": "2022.7.18",
    "time": [],
    "status": []
  },{
   "date": "2022.7.19",
    "time": [
      "15:30"
    ],
    "status": ["Занята"]
  },{
   "date": "2022.7.21",
    "time": ["13:00"],
    "status": ["Занята"]
  },{
   "date": "2022.7.14",
    "time": ["14:00"],
    "status": ["Занята"]
  },{
   "date": "2022.7.22",
    "time": ["09:00"],
    "status": ["Занята"]
  },{
   "date": "2022.7.23",
    "time": [
      "18:00"
    ],
    "status": ["Занята"]
  },{
   "date": "2022.7.25",
    "time": ["12:00"],
    "status": ["Занята"]
  },{
   "date": "2022.7.24",
    "time": ["11:00"],
    "status": ["Занята"]
  },{
   "date": "2022.7.26",
    "time": ["11:00"],
    "status": ["Занята"]
  },{
   "date": "2022.7.27",
    "time": ["11:00"],
    "status": ["Занята"]
  },{
   "date": "2022.7.28",
    "time": ["12:00"],
    "status": ["Занята"]
  },{
   "date": "2022.8.3",
    "time": ["10:00"],
    "status": ["Занята"]
  },{
   "date": "2022.8.1",
    "time": ["16:00"],
    "status": ["Занята"]
  },{
   "date": "2022.8.4",
    "time": ["13:00"],
    "status": ["Занята"]
  },{
   "date": "2022.8.5",
    "time": [
      "14:00",
      "09:00"
    ],
    "status": [
      "Занята",
      "Занята"
    ]
  },{
   "date": "2022.8.15",
    "time": [
      "10:00",
      "15:00"
    ],
    "status": [
      "Занята",
      "Занята"
    ]
  },{
   "date": "2022.8.7",
    "time": [
      "10:00",
      "16:00"
    ],
    "status": [
      "Занята",
      "Занята"
    ]
  },{
   "date": "2022.8.6",
    "time": [
      "10:00",
      "09:00"
    ],
    "status": [
      "Занята",
      "Занята"
    ]
  },{
   "date": "2022.8.9",
    "time": ["15:00"],
    "status": ["Занята"]
  },{
   "date": "2022.8.8",
    "time": ["10:00"],
    "status": ["Занята"]
  },{
   "date": "2022.8.10",
    "time": ["10:00"],
    "status": ["Занята"]
  },{
   "date": "2022.8.19",
    "time": [
      "15:00",
      "09:00"
    ],
    "status": [
      "Занята",
      "Занята"
    ]
  },{
   "date": "2022.8.24",
    "time": [
      "02:00"
    ],
    "status": ["Занята"]
  },{
   "date": "2022.8.14",
    "time": [
      "17:30"
    ],
    "status": ["Занята"]
  },{
   "date": "2022.8.17",
    "time": ["15:00"],
    "status": ["Занята"]
  },{
   "date": "2022.8.18",
    "time": ["09:00"],
    "status": ["Занята"]
  },{
   "date": "2022.8.20",
    "time": [],
    "status": []
  },{
   "date": "2022.8.21",
    "time": ["13:00"],
    "status": ["Занята"]
  },{
   "date": "2022.8.25",
    "time": ["10:00"],
    "status": ["Занята"]
  },{
   "date": "2022.8.22",
    "time": ["14:00"],
    "status": ["Занята"]
  },{
   "date": "2022.8.27",
    "time": [
      "10:00",
      "15:00"
    ],
    "status": [
      "Занята",
      "Занята"
    ]
  },{
   "date": "2022.8.29",
    "time": [
      "10:00",
      "15:00"
    ],
    "status": [
      "Занята",
      "Занята"
    ]
  },{
   "date": "2022.8.28",
    "time": ["16:00"],
    "status": ["Занята"]
  },{
   "date": "2022.8.30",
    "time": ["17:00"],
    "status": ["Занята"]
  },{
   "date": "2022.9.8",
    "time": ["13:00"],
    "status": ["Занята"]
  },{
   "date": "2022.9.6",
    "time": [
      "14:30"
    ],
    "status": ["Занята"]
  },{
   "date": "2022.9.9",
    "time": ["15:00"],
    "status": ["Занята"]
  },{
   "date": "2022.9.7",
    "time": [
      "17:30",
      "10:00"
    ],
    "status": [
      "Занята",
      "Занята"
    ]
  },{
   "date": "2022.9.10",
    "time": [],
    "status": []
  },{
   "date": "2022.9.11",
    "time": [
      "10:00",
      "14:30"
    ],
    "status": [
      "Занята",
      "Занята"
    ]
  },{
   "date": "2022.9.13",
    "time": [],
    "status": []
  },{
   "date": "2022.9.12",
    "time": [
      "13:30",
      "12:00"
    ],
    "status": [
      "Занята",
      "Занята"
    ]
  },{
   "date": "2022.9.15",
    "time": [
      "10:00",
      "15:00"
    ],
    "status": [
      "Занята",
      "Занята"
    ]
  },{
   "date": "2022.9.14",
    "time": [
      "10:00",
      "15:00"
    ],
    "status": [
      "Занята",
      "Занята"
    ]
  },{
   "date": "2022.9.17",
    "time": ["10:00"],
    "status": ["Занята"]
  },{
   "date": "2022.9.19",
    "time": ["10:00"],
    "status": ["Занята"]
  },{
   "date": "2022.9.22",
    "time": ["15:00"],
    "status": ["Занята"]
  },{
   "date": "2022.9.24",
    "time": [
      "16:00",
      "10:00"
    ],
    "status": [
      "Занята",
      "Занята"
    ]
  },{
   "date": "2022.9.21",
    "time": ["12:00"],
    "status": ["Занята"]
  },{
   "date": "2022.9.23",
    "time": ["16:00"],
    "status": ["Занята"]
  },{
   "date": "2022.9.25",
    "time": ["10:00"],
    "status": ["Занята"]
  },{
   "date": "2022.9.30",
    "time": [
      "10:00",
      "15:00"
    ],
    "status": [
      "Занята",
      "Занята"
    ]
  },{
   "date": "2022.9.27",
    "time": ["11:00"],
    "status": ["Занята"]
  },{
   "date": "2022.9.29",
    "time": [
      "15:30",
      "10:00"
    ],
    "status": [
      "Занята",
      "Занята"
    ]
  },{
   "date": "2022.10.1",
    "time": ["11:00"],
    "status": ["Занята"]
  },{
   "date": "2022.10.17",
    "time": [
      "14:30",
      "13:00"
    ],
    "status": [
      "Занята",
      "Занята"
    ]
  },{
   "date": "2022.10.5",
    "time": [
      "14:00",
      "10:00"
    ],
    "status": [
      "Занята",
      "Занята"
    ]
  },{
   "date": "2022.10.2",
    "time": ["10:00"],
    "status": ["Занята"]
  },{
   "date": "2022.10.4",
    "time": ["14:00"],
    "status": ["Занята"]
  },{
   "date": "2022.10.3",
    "time": [
      "10:00",
      "17:30"
    ],
    "status": [
      "Занята",
      "Занята"
    ]
  },{
   "date": "2022.10.9",
    "time": [],
    "status": []
  },{
   "date": "2022.10.11",
    "time": [
      "10:00",
      "14:30"
    ],
    "status": [
      "Занята",
      "Занята"
    ]
  },{
   "date": "2022.10.8",
    "time": ["13:00"],
    "status": ["Занята"]
  },{
   "date": "2022.10.12",
    "time": ["09:00"],
    "status": ["Занята"]
  },{
   "date": "2022.10.18",
    "time": ["13:00"],
    "status": ["Занята"]
  },{
   "date": "2022.10.15",
    "time": [
      "11:30",
      "16:30"
    ],
    "status": [
      "Занята",
      "Занята"
    ]
  },{
   "date": "2022.10.16",
    "time": [
      "11:00",
      "16:00"
    ],
    "status": [
      "Занята",
      "Занята"
    ]
  },{
   "date": "2022.10.19",
    "time": [
      "10:00",
      "14:00"
    ],
    "status": [
      "Занята",
      "Занята"
    ]
  },{
   "date": "2022.11.10",
    "time": [
      "09:00",
      "13:00"
    ],
    "status": [
      "Занята",
      "Занята"
    ]
  },{
   "date": "2022.10.25",
    "time": [
      "13:30"
    ],
    "status": ["Занята"]
  },{
   "date": "2022.10.24",
    "time": ["10:00"],
    "status": ["Занята"]
  },{
   "date": "2022.10.30",
    "time": [
      "13:00",
      "09:00"
    ],
    "status": [
      "Занята",
      "Занята"
    ]
  },{
   "date": "2022.10.27",
    "time": [
      "13:00",
      "14:30"
    ],
    "status": [
      "Занята",
      "Занята"
    ]
  },{
   "date": "2022.10.28",
    "time": ["09:00"],
    "status": ["Занята"]
  },{
   "date": "2022.11.22",
    "time": [
      "09:00",
      "14:00"
    ],
    "status": [
      "Занята",
      "Занята"
    ]
  },{
   "date": "2022.11.27",
    "time": [
      "10:00",
      "14:00"
    ],
    "status": [
      "Занята",
      "Занята"
    ]
  },{
   "date": "2022.11.4",
    "time": [
      "14:00",
      "10:00"
    ],
    "status": [
      "Занята",
      "Занята"
    ]
  },{
   "date": "2022.11.7",
    "time": [
      "09:00",
      "13:00"
    ],
    "status": [
      "Занята",
      "Занята"
    ]
  },{
   "date": "2022.10.29",
    "time": [
      "10:00",
      "14:00"
    ],
    "status": [
      "Занята",
      "Занята"
    ]
  },{
   "date": "2022.11.1",
    "time": ["10:00"],
    "status": ["Занята"]
  },{
   "date": "2022.11.3",
    "time": [
      "13:30",
      "09:30"
    ],
    "status": [
      "Занята",
      "Занята"
    ]
  },{
   "date": "2022.11.5",
    "time": ["13:00"],
    "status": ["Занята"]
  },{
   "date": "2022.11.24",
    "time": [
      "09:00",
      "14:00"
    ],
    "status": [
      "Занята",
      "Занята"
    ]
  },{
   "date": "2022.11.19",
    "time": ["11:00"],
    "status": ["Занята"]
  },{
   "date": "2022.11.13",
    "time": ["13:00"],
    "status": ["Занята"]
  },{
   "date": "2022.11.6",
    "time": ["13:00"],
    "status": ["Занята"]
  },{
   "date": "2022.11.23",
    "time": [
      "12:00",
      "15:30"
    ],
    "status": [
      "Занята",
      "Занята"
    ]
  },{
   "date": "2022.11.9",
    "time": [
      "14:00",
      "10:00"
    ],
    "status": [
      "Занята",
      "Занята"
    ]
  },{
   "date": "2022.11.8",
    "time": ["14:00"],
    "status": ["Занята"]
  },{
   "date": "2022.11.26",
    "time": [
      "09:00",
      "14:00"
    ],
    "status": [
      "Занята",
      "Занята"
    ]
  },{
   "date": "2022.11.11",
    "time": ["11:00"],
    "status": ["Занята"]
  },{
   "date": "2022.11.17",
    "time": [
      "09:00",
      "13:00"
    ],
    "status": [
      "Занята",
      "Занята"
    ]
  },{
   "date": "2022.11.20",
    "time": [
      "13:00",
      "09:00"
    ],
    "status": [
      "Занята",
      "Занята"
    ]
  },{
   "date": "2022.11.14",
    "time": [
      "13:00",
      "09:00"
    ],
    "status": [
      "Занята",
      "Занята"
    ]
  },{
   "date": "2022.11.15",
    "time": [
      "09:00",
      "13:00"
    ],
    "status": [
      "Занята",
      "Занята"
    ]
  },{
   "date": "2022.11.16",
    "time": [
      "13:00",
      "09:00"
    ],
    "status": [
      "Занята",
      "Занята"
    ]
  },{
   "date": "2022.11.30",
    "time": [
      "11:30",
      "14:00"
    ],
    "status": [
      "Занята",
      "Занята"
    ]
  },{
   "date": "2022.11.21",
    "time": [],
    "status": []
  },{
   "date": "2022.11.25",
    "time": [
      "10:00",
      "14:00"
    ],
    "status": [
      "Занята",
      "Занята"
    ]
  },{
   "date": "2023.0.1",
    "time": [],
    "status": []
  },{
   "date": "2023.0.2",
    "time": [
      "10:30"
    ],
    "status": ["Занята"]
  },{
   "date": "2022.11.29",
    "time": [
      "09:00",
      "14:00"
    ],
    "status": [
      "Занята",
      "Занята"
    ]
  },{
   "date": "2022.11.28",
    "time": [
      "13:00",
      "09:00"
    ],
    "status": [
      "Занята",
      "Занята"
    ]
  },{
   "date": "2023.0.4",
    "time": [
      "10:00",
      "14:00",
      "17:00"
    ],
    "status": [
      "Занята",
      "Занята",
      "Занята"
    ]
  },{
   "date": "2023.0.20",
    "time": ["12:00"],
    "status": ["Занята"]
  },{
   "date": "2023.0.21",
    "time": ["10:00"],
    "status": ["Занята"]
  },{
   "date": "2023.0.5",
    "time": [
      "10:00",
      "14:00"
    ],
    "status": [
      "Занята",
      "Занята"
    ]
  },{
   "date": "2023.0.13",
    "time": [
      "10:00",
      "14:00"
    ],
    "status": [
      "Занята",
      "Занята"
    ]
  },{
   "date": "2023.0.14",
    "time": ["13:00"],
    "status": ["Занята"]
  }]